<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 個別指定なしで使う保存先を決める
    |--------------------------------------------------------------------------
    |
    | フレームワークが既定で使うファイル保存先を指定します。
    | `local` だけでなく各種クラウドストレージも選択できます。
    |
    */

    'default' => env('FILESYSTEM_DISK', 'local'),

    /*
    |--------------------------------------------------------------------------
    | 保存先を用途別に切り替えられるようにする
    |--------------------------------------------------------------------------
    |
    | 必要な数だけ保存先ディスクを定義できます。
    | 同じドライバーでも用途ごとに複数の設定を持たせられます。
    |
    | 利用可能: "local", "ftp", "sftp"
    |
    */

    'disks' => [

        'local' => [
            'driver' => 'local',
            'root' => storage_path('app/private'),
            'serve' => true,
            'throw' => false,
            'report' => false,
        ],

        'public' => [
            'driver' => 'local',
            'root' => storage_path('app/public'),
            'url' => rtrim(env('APP_URL'), '/').'/storage',
            'visibility' => 'public',
            'throw' => false,
            'report' => false,
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | 公開用ファイルへ安全に到達できるようにする
    |--------------------------------------------------------------------------
    |
    | `storage:link` 実行時に作成するシンボリックリンクを定義します。
    | 配列キーがリンク作成先、値が実体へのパスです。
    |
    */

    'links' => [
        public_path('storage') => storage_path('app/public'),
    ],

];
